# CSPC 456 3/4/2025
### Midterm stopping at week 6.
```
//router 1
R1#conf t    
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int f0/0
R1(config-if)#ip add dhcp
R1(config-if)#no shut
R1(config-if)#
*Mar  5 01:57:43.479: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  5 01:57:44.479: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1(config-if)#
*Mar  5 01:57:53.939: %DHCP-6-ADDRESS_ASSIGN: Interface FastEthernet0/0 assigned DHCP address 192.168.122.236, mask 255.255.255.0, hostname R1

R1(config-if)#int f1/0
R1(config-if)#ip add 192.168.1.1 255.255.255.252
R1(config-if)#no shut
R1(config-if)#
*Mar  5 01:58:53.103: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to up
*Mar  5 01:58:54.103: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
R1(config-if)#do show ip int br | exclude down 
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.122.236 YES DHCP   up                    up      
FastEthernet1/0        192.168.1.1     YES manual up                    up      

R1(config-if)#router ospf 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#network 192.168.1.0 0.0.0.3 area 0 
R1(config-router)#int f0/0
R1(config-if)#ip nat outside 
R1(config-if)#int f1/0   
R1(config-if)#ip nat inside
R1(config-if)#ip nat inside source list 1 interface f0/0 overload 
R1(config)#access-list 1 permit 192.168.0.0 0.0.255.255
R1(config)#do ping 8.8.8.8
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 8.8.8.8, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/11/20 ms
R1(config)#ping www.google.com
            ^
% Invalid input detected at '^' marker.

R1(config)#do ping www.google.com
Translating "www.google.com"
% Unrecognized host or address, or protocol not running.

R1(config)#ip-domain-lookup
             ^
% Invalid input detected at '^' marker.

R1(config)#ip domain-lookup
R1(config)#ip name-server 192.168.122.1
R1(config)#do ping www.google.com
Translating "www.google.com"...domain server (192.168.122.1) [OK]

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.217.12.100, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/24/32 ms
R1(config)#

```
